# Custom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultipleValuesIndicationSettings..::..Custom Property
MultipleValuesIndicationSettings Class See Also
---
If true, CustomValue is used as multiple values indication, otherwise a hardcoded standard value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool Custom { get; set; }
```

Visual Basic
---
```text
Public Property Custom As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Custom {
	bool get ();
	void set (bool value);
}
```

# See Also
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace